In [2]:
!pip install ipython-sql

Requirement already satisfied: ipython-sql in c:\program files (x86)\microsoft visual studio\shared\anaconda3_64\lib\site-packages (0.4.0)
Requirement already satisfied: six in c:\program files (x86)\microsoft visual studio\shared\anaconda3_64\lib\site-packages (from ipython-sql) (1.11.0)
Requirement already satisfied: sqlalchemy>=0.6.7 in c:\program files (x86)\microsoft visual studio\shared\anaconda3_64\lib\site-packages (from ipython-sql) (1.2.7)
Requirement already satisfied: ipython>=1.0 in c:\program files (x86)\microsoft visual studio\shared\anaconda3_64\lib\site-packages (from ipython-sql) (6.4.0)
Requirement already satisfied: ipython-genutils>=0.1.0 in c:\program files (x86)\microsoft visual studio\shared\anaconda3_64\lib\site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: sqlparse in c:\program files (x86)\microsoft visual studio\shared\anaconda3_64\lib\site-packages (from ipython-sql) (0.3.1)
Requirement already satisfied: prettytable<1 in c:\program files (x86)\microsoft visual studio\shared\anaconda3_64\lib\site-packages (from ipython-sql) (0.7.2)
Requirement already satisfied: backcall in c:\program files (x86)\microsoft visual studio\shared\anaconda3_64\lib\site-packages (from ipython>=1.0->ipython-sql) (0.1.0)
Requirement already satisfied: simplegeneric>0.8 in c:\program files (x86)\microsoft visual studio\shared\anaconda3_64\lib\site-packages (from ipython>=1.0->ipython-sql) (0.8.1)
Requirement already satisfied: jedi>=0.10 in c:\program files (x86)\microsoft visual studio\shared\anaconda3_64\lib\site-packages (from ipython>=1.0->ipython-sql) (0.12.0)
Requirement already satisfied: traitlets>=4.2 in c:\program files (x86)\microsoft visual studio\shared\anaconda3_64\lib\site-packages (from ipython>=1.0->ipython-sql) (4.3.2)
Requirement already satisfied: prompt-toolkit<2.0.0,>=1.0.15 in c:\program files (x86)\microsoft visual studio\shared\anaconda3_64\lib\site-packages (from ipython>=1.0->ipython-sql) (1.0.15)
Requirement already satisfied: setuptools>=18.5 in c:\program files (x86)\microsoft visual studio\shared\anaconda3_64\lib\site-packages (from ipython>=1.0->ipython-sql) (39.1.0)
Requirement already satisfied: pygments in c:\program files (x86)\microsoft visual studio\shared\anaconda3_64\lib\site-packages (from ipython>=1.0->ipython-sql) (2.2.0)
Requirement already satisfied: colorama; sys_platform == "win32" in c:\program files (x86)\microsoft visual studio\shared\anaconda3_64\lib\site-packages (from ipython>=1.0->ipython-sql) (0.3.9)
Requirement already satisfied: decorator in c:\program files (x86)\microsoft visual studio\shared\anaconda3_64\lib\site-packages (from ipython>=1.0->ipython-sql) (4.3.0)
Requirement already satisfied: pickleshare in c:\program files (x86)\microsoft visual studio\shared\anaconda3_64\lib\site-packages (from ipython>=1.0->ipython-sql) (0.7.4)
Requirement already satisfied: parso>=0.2.0 in c:\program files (x86)\microsoft visual studio\shared\anaconda3_64\lib\site-packages (from jedi>=0.10->ipython>=1.0->ipython-sql) (0.2.0)
Requirement already satisfied: wcwidth in c:\program files (x86)\microsoft visual studio\shared\anaconda3_64\lib\site-packages (from prompt-toolkit<2.0.0,>=1.0.15->ipython>=1.0->ipython-sql) (0.1.7)

distributed 1.21.8 requires msgpack, which is not installed.
You are using pip version 10.0.1, however version 20.1 is available.
You should consider upgrading via the 'python -m pip install --upgrade pip' command.

In [3]:
import pyodbc
import sqlalchemy as s

In [4]:
s.create_engine('oracle://hr:At10042001@USER-PC:1521/xe')

Engine(oracle://hr:***@USER-PC:1521/xe)

In [5]:
%load_ext sql

In [6]:
%sql oracle://hr:At10042001@USER-PC:1521/xe

In [7]:
times = %sql Select * From Appointments
df = times.DataFrame()
df

 * oracle://hr:***@USER-PC:1521/xe
0 rows affected.

,employee_id,employee_name,out_patient_name,ident_code,department_name,appointment_day,appointment_time,appointment_date
0,3495678590230,"Catters, Katherine E.","Robinson, Mae A.",23456789087654,Cardiac Surgery,Tuesday,11:00,23-???-2017
1,3495678590230,"Catters, Katherine E.","Burgess, Emmet",34576898765434,Cardiac Surgery,Thursday,11:30,25-???-2017
2,5695678590230,"Specter, Olive H.","Burgess, Emmet",34576898765434,Traumatology,Monday,13:30,22-???-2017
3,5695678590230,"Specter, Olive H.","Risus, Eternity E.",234567887654,Traumatology,Minday,15:30,22-???-2017
4,3495678590230,"Catters, Katherine E.","Catters, Neil A.D.J.",95859404580,Cardiac Surgery,Tuesday,12:00,23-???-2017
5,3495678590230,"Catters, Katherine E.","Risus, Eternity E.",234567887654,Cardiac Surgery,Thursday,12:00,25-???-2017
6,23456789009876,"Gallivan, Viktoria","Catters, Neil A.D.J.",95859404580,Reanimation,Wednesday,10:00,24-???-2017

In [8]:
df.loc[df.employee_name == 'Catters, Katherine E.']

,employee_id,employee_name,out_patient_name,ident_code,department_name,appointment_day,appointment_time,appointment_date
0,3495678590230,"Catters, Katherine E.","Robinson, Mae A.",23456789087654,Cardiac Surgery,Tuesday,11:00,23-???-2017
1,3495678590230,"Catters, Katherine E.","Burgess, Emmet",34576898765434,Cardiac Surgery,Thursday,11:30,25-???-2017
4,3495678590230,"Catters, Katherine E.","Catters, Neil A.D.J.",95859404580,Cardiac Surgery,Tuesday,12:00,23-???-2017
5,3495678590230,"Catters, Katherine E.","Risus, Eternity E.",234567887654,Cardiac Surgery,Thursday,12:00,25-???-2017

In [9]:
df.loc[df.employee_name == 'Specter, Olive H.']

,employee_id,employee_name,out_patient_name,ident_code,department_name,appointment_day,appointment_time,appointment_date
2,5695678590230,"Specter, Olive H.","Burgess, Emmet",34576898765434,Traumatology,Monday,13:30,22-???-2017
3,5695678590230,"Specter, Olive H.","Risus, Eternity E.",234567887654,Traumatology,Minday,15:30,22-???-2017

In [10]:
df.loc[df.employee_name == 'Gallivan, Viktoria']

,employee_id,employee_name,out_patient_name,ident_code,department_name,appointment_day,appointment_time,appointment_date
6,23456789009876,"Gallivan, Viktoria","Catters, Neil A.D.J.",95859404580,Reanimation,Wednesday,10:00,24-???-2017

In [11]:
df.employee_name.mode()

0    Catters, Katherine E.
dtype: object

In [15]:
df.department_name.mode()

0    Cardiac Surgery
dtype: object

In [14]:
ails = %sql Select * From In_Hospital_Patients
df1 = ails.DataFrame()
df1

 * oracle://hr:***@USER-PC:1521/xe
0 rows affected.

,patient_name,ident_code,birthdate,phone_num,district_id,ad_street,ad_house,ad_flat,department_id,ailment_id,category_id,employee_id,start_date,finish_date
0,"Grace, Virginia",7689049385949,2001-01-07,4356457657,54,Lackenrid,456,0,107,35,1,23456789009876,2016-12-21,2017-03-19
1,"Hers, Sydney",23456789876545,2001-03-23,9874567896,53,Backert,46,0,102,32,1,23456789009876,2017-03-19,2017-05-03
2,"Richards, Tiffany",5678765433456,2001-05-09,3456534587,54,Lowstone,198,0,102,32,1,5695678590230,2017-03-20,2017-05-03
3,"Maicon, Jonas",7654567898765,2000-12-31,3465434565,54,Lowstone,45,0,102,32,1,5695678590230,2017-03-21,2017-05-03
4,"Johnas, Dug",76545665434565,1995-09-05,9846654334,53,Maroons,23,0,104,33,2,3495678590230,2017-02-27,2017-03-16
5,"Manson, Cordelia",9876543456,1979-08-06,57866787,55,Golden-Gate,165,0,104,33,2,3495678590230,2017-02-17,2017-03-04
6,"Cadman, Ali",345676543345,1980-01-18,876534564,55,Ags-Alley,131,0,104,33,1,3495678590230,2017-02-21,2017-03-07

In [16]:
df1.ailment_id.mode()

0    32
1    33
dtype: int64

In [17]:
df1.category_id.mode()

0    1
dtype: int64

In [18]:
df1.district_id.mode()

0    54
dtype: int64

In [20]:
out = %sql Select * From Out_Hospital_Patients
df2 = out.DataFrame()
df2

 * oracle://hr:***@USER-PC:1521/xe
0 rows affected.

,ident_code,out_patient_name,birthdate,phone_num,district_id,ad_street,ad_house,ad_flat,employee_id
0,95859404580,"Catters, Neil A.D.J.",2000-09-18,686055993,54,Superno,137,0,3495678590230
1,23456789087654,"Robinson, Mae A.",2000-12-05,685593993,56,Fidele,17,0,3495678590230
2,34576898765434,"Burgess, Emmet",2000-10-06,67608978,54,Likely,17,0,3495678590230
3,234567887654,"Risus, Eternity E.",2001-04-24,456789987,54,Likely,26,0,5695678590230

In [21]:
df2.district_id.mode()

0    54
dtype: int64